app/controllers/movies_controller.rb

  def index
    sort = params[:sort] || session[:sort]
    case sort
      when 'title'
        ordering,@title_header = {:title => :asc}, 'hilite'
      when 'release_date'
        ordering,@date_header = {:release_date => :asc}, 'hilite'
    end
    @all_ratings = Movie.all_ratings
    @selected_ratings =
    if params[:ratings]
      params[:ratings].to_unsafe_h
    else
      session[:ratings] || {}
    end
    if session[:ratings] != params[:ratings] or params[:sort] != session[:sort]
      session[:ratings] = @selected_ratings
      session[:sort] = sort
    end
    @movies = Movie.where(rating: @selected_ratings.keys).order(ordering)
---
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'PG')

  def create
    @movie = Movie.new(movie_params)
    if @movie.save
---
INSERT INTO "movies" ("title", "rating", "description", "release_date", "created_at", "updated_at") VALUES ('R', NULL, NULL, NULL, '2026-04-12 13:38:10.056912', '2026-04-12 13:38:10.056912') RETURNING "id"